app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:new_songs].path, headers: true) do |new_song|
      @song_artist = Artist.find_or_create_by(name: new_song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-08-20 00:32:35.457113"], ["updated_at", "2018-08-20 00:32:35.457113"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-08-20 00:32:35.460217"], ["updated_at", "2018-08-20 00:32:35.460217"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]